SvnBridgeLibrary/Infrastructure/Messages/SetWorkItemStatusToFixedMessage.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<soap:Header>
		<RequestHeader xmlns="http://schemas.microsoft.com/TeamFoundation/2005/06/WorkItemTracking/ClientServices/03">
			<Id>uuid:{Guid}</Id>
		</RequestHeader>
	</soap:Header>
	<soap:Body>
		<Update xmlns="http://schemas.microsoft.com/TeamFoundation/2005/06/WorkItemTracking/ClientServices/03">
			<package>
				<Package Product="{ServerUrl}/WorkItemTracking/v1.0/ClientService.asmx" xmlns="">
					<UpdateWorkItem WorkItemID="{WorkItemId}" Revision="{RevisionId}" ObjectType="WorkItem">
						<ComputedColumns>
							<ComputedColumn Column="System.RevisedDate" />
							<ComputedColumn Column="System.ChangedDate" />
							<ComputedColumn Column="System.PersonId" />
							<ComputedColumn Column="Microsoft.VSTS.Common.StateChangeDate" />
							<ComputedColumn Column="CodePlex.UpdatedBy" />
						</ComputedColumns>
						<Columns>
							<Column Column="System.State">
								<Value>Fixed</Value>
							</Column>
							<Column Column="System.Reason">
								<Value>Fixed</Value>
							</Column>
							<Column Column="Microsoft.VSTS.Common.StateChangeDate" Type="ServerDateTime">
								<Value />
							</Column>
							<Column Column="CodePlex.UpdatedBy">
								<Value>{UserName}</Value>
							</Column>
						</Columns>
					</UpdateWorkItem>
				</Package>
			</package>
		</Update>
	</soap:Body>
</soap:Envelope>